Merge pull request #10 from padillag/architecture_update
Update readme file
